tap "ariga/tap"
tap "lizardbyte/homebrew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Modern, maintained replacement for ls
brew "eza"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# Postgres C API library
brew "libpq", link: true
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A database toolkit
brew "ariga/tap/atlas"
# GPU-accelerated terminal emulator
cask "alacritty"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Menu bar manager
cask "jordanbaird-ice"
# Password manager app
cask "keepassxc"
# Clipboard manager
cask "maccy"
# GameStream client
cask "moonlight"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Peer to peer Bitorrent client
cask "qbittorrent"
# System monitor for the menu bar
cask "stats"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Web browser
cask "yandex"
# Cloud storage
cask "yandex-disk"
# Multiplayer code editor
cask "zed"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
vscode "alpha4.jsonl"
vscode "bbenoist.nix"
vscode "bruno-api-client.bruno"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "vue.volar"
vscode "zignd.html-css-class-completion"
