tap "ariga/tap"
tap "grishka/grishka"
tap "krishkrosh/apps"
tap "lizardbyte/homebrew"
tap "oven-sh/bun"
tap "supabase/tap"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Standalone version of arguments parsing functions from GLIBC
brew "argp-standalone"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Implementation of the DNS protocols
brew "bind"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# Fast linters runner for Go
brew "golangci-lint"
# Manage your personal accounts at home
brew "homebank"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Microsoft (MS) EMF to SVG conversion library
brew "libemf2svg"
# Postgres C API library
brew "libpq", link: true
# Base library for writing document import filters
brew "librevenge"
# Interpret and import Visio diagrams
brew "libvisio"
# Library for converting WMF (Window Metafile Format) files
brew "libwmf"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Theme for zsh
brew "powerlevel10k"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Non-interactive SSH password auth
brew "sshpass"
# User interface to the TELNET protocol
brew "telnet"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A database toolkit
brew "ariga/tap/atlas"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Supabase CLI
brew "supabase/tap/supabase"
# GPU-accelerated terminal emulator
cask "alacritty"
# Desktop password and login vault
cask "bitwarden"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake-app"
# Vector graphics editor
cask "inkscape"
# Menu bar manager
cask "jordanbaird-ice"
# Password manager app
cask "keepassxc"
# Open-source keystroke visualiser
cask "keycastr"
# Customise mouse behavior
cask "linearmouse"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Clipboard manager
cask "maccy"
# GameStream client
cask "moonlight"
cask "mqtt-explorer"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# System monitor for the menu bar
cask "stats"
# CSV file editor
cask "table-tool"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Turn your MacBook's trackpad into a precise digital weighing scale
cask "trackweight"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Web browser
cask "yandex"
# Cloud storage
cask "yandex-disk"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
vscode "alpha4.jsonl"
vscode "bbenoist.nix"
vscode "bruno-api-client.bruno"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "kilocode.kilo-code"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "vue.volar"
vscode "zignd.html-css-class-completion"
go "github.com/air-verse/air"
go "github.com/go-delve/delve/cmd/dlv"
go "goa.design/goa/v3/cmd/goa"
go "golang.org/x/tools/gopls"
go "github.com/oapi-codegen/oapi-codegen/v2/cmd/oapi-codegen"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/sorcererxw/protoc-gen-go-grpc-mock"
go "github.com/favadi/protoc-go-inject-tag"
go "github.com/xvzc/SpoofDPI/cmd/spoofdpi"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "honnef.co/go/tools/cmd/staticcheck"
